{
  "backend/main.mo": "Motoko backend managing stories, comments, categories, and night mode with CRUD-style query and update methods.",
  "feature_evidence.json": "Feature evidence report listing components, files, and metadata for diagnosing a deployment build failure.",
  "frontend-file-summaries.txt": "Prewritten summaries of all main frontend files including components, pages, hooks, and config.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme variables and applying global background and text settings.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, category, story, and search pages using SiteLayout.",
  "frontend/src/components/AdSlotPlaceholder.tsx": "UI placeholder component displaying a styled mock advertisement slot.",
  "frontend/src/components/AffiliateLinksPlaceholder.tsx": "UI placeholder component showing sample affiliate link items for horror book recommendations.",
  "frontend/src/components/CommentsSection.tsx": "Displays comments for a story and allows authenticated users to post new comments.",
  "frontend/src/components/HeaderNav.tsx": "Responsive site header with navigation links, search toggle, and Internet Identity login controls.",
  "frontend/src/components/NightModeToggle.tsx": "Button component that toggles night mode using a custom hook.",
  "frontend/src/components/SearchBar.tsx": "A search bar component with input, clear button, and submit handling that triggers onSearch with the query.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main site layout including header, content outlet, and a footer with branding and external link.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card with category, date, title, excerpt, and a link to the full story.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useComments.ts": "Provides hooks to fetch comments for a story and add new comments via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useNightMode.ts": "Manages night mode state with localStorage persistence and a toggle function.",
  "frontend/src/hooks/useStories.ts": "Hooks for fetching latest stories, category stories, individual stories, and search results via the backend actor.",
  "frontend/src/index.css": "Global Tailwind-based horror theme styling with dark colors, custom fonts, and scrollbar styling.",
  "frontend/src/lib/categories.ts": "Defines story categories and helper functions to look them up and get their labels.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/CategoryPage.tsx": "Renders a category page with header, ad slot, and list of stories for the chosen category.",
  "frontend/src/pages/HomePage.tsx": "Home page showing a hero section, ad slot, and latest stories grid.",
  "frontend/src/pages/SearchPage.tsx": "Implements the search page, reading the query from router params, calling useSearchStories, and rendering search UI, loading states, and story results.",
  "frontend/src/pages/StoryPage.tsx": "Displays a full story fetched by ID, showing metadata, night-mode styling, content, and sections for ads, affiliate links, and comments.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, fonts, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Defines the project’s current state, features, requirements, known issues, and architectural notes for the horror storytelling website."
}