{
  "backend/main.mo": "Main canister actor handling user profiles, logo upload, and full story CRUD with categories, thumbnails, YouTube links, and comments, protected by admin/user access control.",
  "backend/migration.mo": "Migration module converting old story records into the new format by adding youtubeUrl and thumbnail fields initialized to null.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend files, feature IDs, related components, and test IDs for media and admin UI updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing components, pages, hooks, and styling utilities used across the application.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode colors and global styling rules for the frontend.",
  "frontend/index.html": "HTML entry point mounting the React root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up all application routes using TanStack Router and wraps them in the SiteLayout component.",
  "frontend/src/components/AdSlotPlaceholder.tsx": "UI component displaying a styled placeholder card representing an advertisement slot.",
  "frontend/src/components/AffiliateLinksPlaceholder.tsx": "UI component rendering a styled placeholder section for affiliate book links.",
  "frontend/src/components/CommentsSection.tsx": "Comments UI with authentication checks, comment posting, and listing using hooks for identity and backend comment APIs.",
  "frontend/src/components/HeaderNav.tsx": "Navigation header component with logo, category links, search, mobile menu, and identity-based admin actions.",
  "frontend/src/components/NightModeToggle.tsx": "Button component that toggles night mode using local state from a custom hook.",
  "frontend/src/components/SearchBar.tsx": "Search input form with clear and submit actions that triggers a callback with the query.",
  "frontend/src/components/SiteLayout.tsx": "Main site layout wrapper providing header, content outlet, and footer.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card with thumbnail, metadata, excerpt, and link to the full story.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, invalidating related queries on change.",
  "frontend/src/hooks/useComments.ts": "Hooks for fetching and adding comments for a story via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider handling login, stored identities, status tracking, and clearing sessions.",
  "frontend/src/hooks/useLogo.ts": "Hooks to fetch, upload, delete the site logo and convert logo data into a displayable URL.",
  "frontend/src/hooks/useNightMode.ts": "Hook managing night mode state persisted in localStorage.",
  "frontend/src/hooks/useStories.ts": "Hooks for fetching, searching, and creating stories, including optional thumbnail upload.",
  "frontend/src/hooks/useThumbnail.ts": "React Query hooks for fetching, uploading, and deleting story thumbnails, plus a helper to convert stored logo data into a displayable URL.",
  "frontend/src/index.css": "Global Tailwind-based styles defining a horror-themed color palette, typography, and custom scrollbars.",
  "frontend/src/lib/categories.ts": "Defines story category metadata and helper functions to look up categories and labels.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity context before rendering the app.",
  "frontend/src/pages/AdminLogoPage.tsx": "Admin interface for uploading, previewing, and deleting the site logo with validation and permission handling.",
  "frontend/src/pages/AdminStoryNewPage.tsx": "Admin form for creating new stories with fields for metadata, content, optional YouTube link, and thumbnail upload.",
  "frontend/src/pages/CategoryPage.tsx": "Displays stories for a specific category with loading states and a decorative horror-themed layout.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero section, ads, and a grid of the latest horror stories.",
  "frontend/src/pages/SearchPage.tsx": "Search interface that retrieves and displays stories matching a text query with loading and empty states.",
  "frontend/src/pages/StoryPage.tsx": "React page that loads and displays a full story with thumbnail, metadata, YouTube embed, night mode styling, and comments.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters and sessionStorage values.",
  "frontend/src/utils/youtube.ts": "Parses YouTube URLs, validates them, extracts video IDs, and generates embed URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and theme settings for the project.",
  "project_state.json": "Project metadata describing site goals, implemented features, known issues, and architectural notes."
}