{
  "backend/main.mo": "Main canister logic implementing user profiles, logo storage, story management with categories, comments, permissions, and migration support.",
  "backend/migration.mo": "Migration module converting old story/comment data to the new schema with view counts, follower count, and renamed comment fields.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten list of summaries describing the purpose of key frontend files including pages, components, hooks, and configuration.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables and dark theme rules for the site.",
  "frontend/index.html": "Base HTML document providing the root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, story pages, categories, search, and admin tools within the main layout.",
  "frontend/src/components/AdSlotPlaceholder.tsx": "Component rendering a styled placeholder for advertisement slots using a dashed card layout.",
  "frontend/src/components/AffiliateLinksPlaceholder.tsx": "Component showing a styled placeholder section for recommended horror book affiliate links.",
  "frontend/src/components/CommentsSection.tsx": "Renders a comments form and list, fetching and posting comments via hooks tied to a story ID.",
  "frontend/src/components/FollowButton.tsx": "Displays a follow button that handles login, follow action, and shows follower count.",
  "frontend/src/components/HeaderNav.tsx": "Provides the site header with logo, navigation links, search, follow button, and auth-related controls.",
  "frontend/src/components/NightModeToggle.tsx": "Toggle button that switches between night and light mode using a custom hook.",
  "frontend/src/components/SearchBar.tsx": "A search input with clear and submit actions that triggers an external search handler.",
  "frontend/src/components/SiteLayout.tsx": "Defines the overall site layout with header, main content outlet, and footer.",
  "frontend/src/components/StoryCard.tsx": "Displays a story preview card with thumbnail, metadata, excerpt, and link to the full story.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on authentication state, auto‑refreshing dependent queries.",
  "frontend/src/hooks/useComments.ts": "Provides hooks for fetching and adding story comments through the backend actor.",
  "frontend/src/hooks/useFollowWebsite.ts": "Provides hooks for fetching follower count and performing a follow action, updating queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and tracking login status.",
  "frontend/src/hooks/useLogo.ts": "Defines hooks to fetch, upload, delete, and display the site logo using an actor and React Query.",
  "frontend/src/hooks/useNightMode.ts": "Implements a night mode toggle with persistence in localStorage.",
  "frontend/src/hooks/useStories.ts": "Provides hooks for querying, searching, and creating stories, including optional thumbnail uploads, via actor calls and React Query.",
  "frontend/src/hooks/useStoryViews.ts": "Adds a mutation hook to increment a story’s view count and refresh related queries.",
  "frontend/src/hooks/useThumbnail.ts": "Implements hooks to fetch, upload, delete, and display story thumbnails, invalidating related queries appropriately.",
  "frontend/src/index.css": "Defines Tailwind base styles and a horror-themed dark UI with custom fonts, colors, and scrollbars.",
  "frontend/src/lib/categories.ts": "Exports story category definitions and helper functions to look up categories and labels.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminLogoPage.tsx": "Admin UI for uploading, previewing, and deleting the site logo with authentication and validation.",
  "frontend/src/pages/AdminStoryNewPage.tsx": "Form page for creating new stories with authentication, image upload, YouTube URL validation, and submission handling.",
  "frontend/src/pages/CategoryPage.tsx": "Displays stories for a specific category with loading states and fallback messaging.",
  "frontend/src/pages/HomePage.tsx": "Shows hero section and latest stories, including loading and empty-state handling.",
  "frontend/src/pages/SearchPage.tsx": "Provides search UI for querying stories and displays results with loading and empty states.",
  "frontend/src/pages/StoryPage.tsx": "Renders a full story view with thumbnail, metadata, YouTube embed, comments, and view-count incrementing.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/src/utils/youtube.ts": "Utility functions for validating YouTube URLs, extracting video IDs, and generating embed URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors via CSS variables, extended typography, animations, and plugins for container queries and animations.",
  "project_state.json": "Project state defining requirements for a Hindi horror storytelling site, listing features, architectural notes, and known deployment issues."
}