{
  "backend/main.mo": "Motoko canister handling user profiles, logo storage, and CRUD operations for horror stories with access control for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of various frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark horror-themed color palettes and global styles.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public pages and admin pages including story creation and logo management.",
  "frontend/src/components/AdSlotPlaceholder.tsx": "UI placeholder component showing a styled ad slot card with icon and labels.",
  "frontend/src/components/AffiliateLinksPlaceholder.tsx": "UI placeholder card displaying example affiliate book entries with icons and buttons.",
  "frontend/src/components/CommentsSection.tsx": "Comments UI allowing authenticated users to post comments and showing comment lists with loading and empty states.",
  "frontend/src/components/HeaderNav.tsx": "Responsive header with logo, navigation links, identity actions, and search handling.",
  "frontend/src/components/NightModeToggle.tsx": "Button component that toggles night mode using the night mode hook.",
  "frontend/src/components/SearchBar.tsx": "Search input form with submit and clear actions for querying stories.",
  "frontend/src/components/SiteLayout.tsx": "Main site layout including header, routed content area, and footer with credits.",
  "frontend/src/components/StoryCard.tsx": "Card UI for displaying a story preview with category, date, excerpt, and link to full story.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useComments.ts": "Hooks for fetching and adding story comments via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, state, and stored identity handling.",
  "frontend/src/hooks/useLogo.ts": "Hooks for retrieving, uploading, and deleting the site logo plus helper to create a URL for display.",
  "frontend/src/hooks/useNightMode.ts": "LocalStorage-backed hook to read and toggle night mode state.",
  "frontend/src/hooks/useStories.ts": "Hooks for querying and mutating story data including latest, by category, search, and creation.",
  "frontend/src/index.css": "Defines global Tailwind layers, horror-themed color variables, fonts, scrollbar styling, and prose formatting.",
  "frontend/src/lib/categories.ts": "Defines story category metadata and helper functions for lookup and labeling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminLogoPage.tsx": "Admin page for uploading, previewing, and deleting a site logo with authentication checks.",
  "frontend/src/pages/AdminStoryNewPage.tsx": "Admin form for creating new stories with validation, category selection, and post-submit navigation.",
  "frontend/src/pages/CategoryPage.tsx": "Displays stories for a specific category with loading states and fallback UI.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage hero section and latest stories grid with loading and empty states.",
  "frontend/src/pages/SearchPage.tsx": "Provides search input and renders matching stories with loading and empty result states.",
  "frontend/src/pages/StoryPage.tsx": "Displays a full story with category, date, night mode, ads, affiliate links, and comments, handling loading and error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters and session-stored values, with hash-routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, fonts, animations, and plugins for the project's dark themed UI.",
  "project_state.json": "Stores the project's current state, features, issues, and metadata for the horror storytelling website."
}