{
  "kind": "build_request",
  "title": "Add admin panel page for creating horror stories (title, category, full text)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Create a new admin page that requires the user to be signed in with Internet Identity and provides a form to create a new horror story with fields: Title, Category, and Full story text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create admin panel to add horror stories.\nEach story should have:\nTitle\nCategory\nFull story text\n\nShow stories on homepage in latest order.\nHindi language supported."
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated, the admin story page shows an auth-required state with a Sign In action (similar UX to AdminLogoPage).",
        "When authenticated, the page shows a create-story form with inputs for Title, Category (selecting from the existing categories list), and Full story text.",
        "The form accepts and preserves Hindi/Devanagari text in Title and Full story text inputs without rendering issues.",
        "The page is responsive and usable on mobile screens (no horizontal overflow; inputs/buttons fit within viewport)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add frontend data layer support to create stories by calling the backend addStory method, and invalidate/refetch relevant story queries (latest, category, and search) after a successful create.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create admin panel to add horror stories."
        ]
      },
      "acceptanceCriteria": [
        "Submitting the form calls the backend to create a story.",
        "After successful creation, the app refreshes the latest stories list so the new story can appear without a hard reload.",
        "Error states (including unauthorized/admin-only errors) are surfaced to the user in a readable message on the admin story page."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add routing and navigation access for the new admin story page, including a route under /admin (e.g., /admin/stories or /admin/story/new) and a visible navigation entry for authenticated users alongside the existing admin logo link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create admin panel to add horror stories."
        ]
      },
      "acceptanceCriteria": [
        "A new route exists for the admin story creation page and can be visited directly by URL.",
        "When authenticated, the site header navigation shows a link to the admin story creation page (desktop and mobile menus).",
        "When not authenticated, the admin story creation page is still routable but shows the auth-required state instead of the form."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose these components instead).",
    "Respect the existing backend single-actor architecture; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Implementing thumbnail image upload for stories.",
    "Implementing optional video (YouTube link or video upload) for stories.",
    "Implementing edit/delete story functionality in the admin UI.",
    "Changing the existing homepage story ordering logic beyond ensuring it continues to show newest-first from getLatestStories."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}