{
  "kind": "build_request",
  "title": "Add engagement features: public stories, view counts, public name+message comments, and follow button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Ensure every newly created story is immediately publicly visible after creation (no draft/private state) and appears in the public latest stories feed without requiring any additional publish action.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Every story should be automatically public after creation."
        ]
      },
      "acceptanceCriteria": [
        "After an admin creates a story via the existing admin create-story flow, the story is visible to unauthenticated visitors on the homepage latest stories list and on its story reading page.",
        "There is no UI or backend state that requires a separate publish action for stories (i.e., stories are public by default)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add a per-story view counter that tracks total reads and display the total reads on the story reading page.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add view counter for each story (show total reads)."
        ]
      },
      "acceptanceCriteria": [
        "Backend stores a persistent view count per story and returns it with story data (or via a dedicated endpoint).",
        "Opening a story reading page triggers exactly one view increment per page load (avoid double-counting due to React dev rendering patterns).",
        "The story reading page displays a user-facing label in English, e.g., \"Total reads: 123\".",
        "Existing story listing cards and homepage continue to work; no breaking changes to latest/category/search fetching."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Change the public story comments section to support simple public comments with fields: name + message, and allow all visitors (including unauthenticated users) to post and read comments under every story.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add comment section under every story (name + message)."
        ]
      },
      "acceptanceCriteria": [
        "Story pages show a comments section for every story.",
        "Visitors can submit a comment by providing a display name and a message (both validated to be non-empty after trimming).",
        "Comments are publicly readable to all visitors.",
        "Posting a comment does not require Internet Identity authentication.",
        "Existing authenticated-only comment logic is either preserved alongside the new public comments or replaced cleanly without breaking the story page."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Add a follow/subscribe button that lets users follow the website, persist their follow status, and display follower count in the UI without collecting emails.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add follow/subscribe button so users can follow the website."
        ]
      },
      "acceptanceCriteria": [
        "A visible \"Follow\" / \"Following\" button is added in a prominent site-wide location (e.g., header and/or footer) with English user-facing text.",
        "Follow state is persisted per signed-in Internet Identity principal (no email collection/storage).",
        "Unauthenticated visitors who click follow are prompted to sign in with Internet Identity, then can follow/unfollow.",
        "UI can show the total follower count (e.g., \"Followers: 10\") and updates after follow/unfollow.",
        "No email subscribe box is added back anywhere in the UI."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Maintain the existing dark horror theme and ensure new engagement UI elements (reads count, public comments form, follow button) are fully mobile-friendly and responsive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Mobile friendly layout.",
          "Keep dark horror theme design same."
        ]
      },
      "acceptanceCriteria": [
        "New UI elements match existing styling conventions (dark background, red/destructive accents, existing typography) and do not introduce a new theme.",
        "On small screens, the follow button, reads label, and comments form fields stack appropriately with comfortable spacing and tap targets.",
        "No horizontal scrolling is introduced on mobile due to new components."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit files under frontend immutablePaths (compose components instead).",
    "Do not re-introduce any email subscription UI or email storage.",
    "Keep the existing dark horror theme; only extend it for new elements."
  ],
  "nonGoals": [
    "Integrating external newsletter/email providers or sending notifications/emails.",
    "Adding third-party auth providers beyond Internet Identity.",
    "Adding real-time updates (WebSockets) for views/comments/followers.",
    "Adding social media API integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}