{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin story creation page (Internet Identity) with React Query create + refresh",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add an authenticated admin page with a responsive create-horror-story form (title, category, full text) supporting Hindi text input.",
      "acceptanceCriteria": [
        "When not authenticated, the admin story page shows an auth-required state with a Sign In action (similar UX to AdminLogoPage).",
        "When authenticated, the page shows a create-story form with inputs for Title, Category (selecting from the existing categories list), and Full story text.",
        "The form accepts and preserves Hindi/Devanagari text in Title and Full story text inputs without rendering issues.",
        "The page is responsive and usable on mobile screens (no horizontal overflow; inputs/buttons fit within viewport)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminStoryNewPage.tsx",
          "operation": "create",
          "description": "Create the new admin story creation page UI. Mirror the unauthenticated auth-required Card UX from AdminLogoPage (Sign In action via useInternetIdentity). When authenticated, render a responsive form using shadcn-ui components (e.g., Card, Button, Input, Textarea, Select) and populate the Category select from the existing categories list in frontend/src/lib/categories.ts. Ensure the form controls use full-width, mobile-friendly layout and do not constrain/transform Hindi text. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add a React Query mutation to create stories via backend addStory and refresh latest/category/search story queries after success, surfacing errors on the admin page.",
      "acceptanceCriteria": [
        "Submitting the form calls the backend to create a story.",
        "After successful creation, the app refreshes the latest stories list so the new story can appear without a hard reload.",
        "Error states (including unauthorized/admin-only errors) are surfaced to the user in a readable message on the admin story page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useStories.ts",
          "operation": "modify",
          "description": "Add a story-creation data-layer hook (React Query mutation) that calls the backend capability addStory via useActor(). The hook should accept title/content/category, derive an excerpt client-side (e.g., first N characters from content, preserving Unicode/Hindi text), and on success invalidate/refetch relevant queries (query keys for latest, category, and search) so HomePage/CategoryPage/SearchPage refresh without a hard reload."
        },
        {
          "path": "frontend/src/pages/AdminStoryNewPage.tsx",
          "operation": "modify",
          "description": "Wire the create-story form submission to the new useStories create mutation, show pending/disabled UI while submitting, and display success and readable error messages (including unauthorized/admin-only failures) using shadcn-ui Alert components. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Register a new /admin route for story creation and add a header navigation link visible only to authenticated users (desktop and mobile).",
      "acceptanceCriteria": [
        "A new route exists for the admin story creation page and can be visited directly by URL.",
        "When authenticated, the site header navigation shows a link to the admin story creation page (desktop and mobile menus).",
        "When not authenticated, the admin story creation page is still routable but shows the auth-required state instead of the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new TanStack Router route under /admin (e.g., /admin/story/new) that renders AdminStoryNewPage, and include it in the route tree so it is directly navigable by URL."
        },
        {
          "path": "frontend/src/components/HeaderNav.tsx",
          "operation": "modify",
          "description": "Add a visible navigation entry for authenticated users to reach the new admin story creation route, alongside the existing admin logo link, in both desktop nav and the mobile Sheet menu. Use existing shadcn-ui navigation building blocks already in this file. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}