{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Story media support (thumbnails + YouTube) and improved admin/mobile UX",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Enhance the admin story creation form to capture optional thumbnail upload and optional YouTube URL, validate inputs, and persist media during story creation with query refresh.",
      "acceptanceCriteria": [
        "Admin create-story form includes an optional thumbnail file input with client-side validation (image-only MIME types and a reasonable max size consistent with existing logo upload UX).",
        "Admin create-story form includes an optional YouTube URL input; invalid URLs show an English validation error and do not submit.",
        "On successful creation, the story is created and (if provided) its YouTube URL is saved and its thumbnail is uploaded/associated with the newly created story id.",
        "After success, relevant React Query story queries are invalidated/refetched (latest/category/search) so the new story and its media are visible without a hard refresh.",
        "All new user-facing strings introduced by this change are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/youtube.ts",
          "operation": "create",
          "description": "Add YouTube URL parsing/validation helpers that accept common watch/share URL formats, extract a safe video id, and produce an embed-safe URL suitable for iframe usage (no arbitrary HTML)."
        },
        {
          "path": "frontend/src/hooks/useStories.ts",
          "operation": "modify",
          "description": "Update story creation mutation to accept an optional YouTube URL (null when omitted) and to upload an optional thumbnail after story creation using existing backend actor capabilities; ensure React Query invalidates/refetches relevant story queries (latest/category/search) and any thumbnail-related caches. (Uses core-infrastructure actor wiring and follows authorization component patterns for authenticated calls; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/AdminStoryNewPage.tsx",
          "operation": "modify",
          "description": "Extend the create-story form UI to include: (1) optional thumbnail file input with image MIME validation and max size consistent with AdminLogoPage (2MB), including preview with object URL cleanup; (2) optional YouTube URL input with validation errors in English and an optional responsive preview; and save media during submission by passing youtubeUrl and thumbnail to the create mutation. Keep layout mobile-friendly (stack controls/buttons on small screens). (Use existing shadcn-ui form components already present in the page; Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Display story thumbnails on story cards and story page with placeholder fallback, and embed YouTube videos on the story page responsively and safely.",
      "acceptanceCriteria": [
        "Story cards (frontend/src/components/StoryCard.tsx) display a thumbnail image area; if the story has no uploaded thumbnail, the existing placeholder thumbnail is shown.",
        "Story reading page (frontend/src/pages/StoryPage.tsx) displays the thumbnail near the story header when available, otherwise uses the existing placeholder thumbnail behavior.",
        "If a story has a YouTube URL, StoryPage embeds it as a responsive 16:9 iframe (or equivalent) that fits on mobile without horizontal scrolling.",
        "The YouTube embed uses an embed-safe URL derived from the provided link (e.g., watch/share forms supported) and does not execute arbitrary HTML from story content.",
        "Thumbnail object URLs created in the browser are cleaned up to avoid memory leaks (similar to existing logo preview behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useThumbnail.ts",
          "operation": "create",
          "description": "Create React Query hooks to fetch a story thumbnail by story id and a helper to convert returned logo/thumbnail bytes into a browser object URL for <img> display; ensure callers can revoke created object URLs to prevent leaks. (Uses core-infrastructure actor wiring; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/StoryCard.tsx",
          "operation": "modify",
          "description": "Add a thumbnail area to the story card: fetch and render the story thumbnail (via the new thumbnail hook) and fall back to the existing placeholder image at frontend/public/assets/generated/story-thumbnail-placeholder.dim_800x450.png when none exists; ensure any object URL used for the thumbnail is revoked on change/unmount. (Use existing shadcn-ui Card/Button primitives already imported; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/StoryPage.tsx",
          "operation": "modify",
          "description": "Render the story thumbnail near the header using the thumbnail hook with fallback to frontend/public/assets/generated/story-thumbnail-placeholder.dim_800x450.png and object-URL cleanup; if youtubeUrl exists, embed a responsive 16:9 iframe using an embed-safe URL from the YouTube utility (no HTML injection) and ensure it is mobile-friendly (no horizontal scrolling). (Use existing shadcn-ui Card/Separator/Badge/Button primitives already imported; Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add a prominent Add Story entry within the admin area and make admin pages (create story + logo) mobile-friendly, including the new media controls.",
      "acceptanceCriteria": [
        "Authenticated users can see a clearly labeled \"Add Story\" button/link within the admin area (not only buried in navigation), which takes them to the existing /admin/story/new route.",
        "Admin pages (at minimum: AdminStoryNewPage and AdminLogoPage) render cleanly on small screens (no overflow, form controls full-width where appropriate, buttons accessible).",
        "Media controls added for thumbnails/YouTube remain usable on mobile (file input, preview, and video preview/embed sizing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminLogoPage.tsx",
          "operation": "modify",
          "description": "Add a prominent, clearly labeled \"Add Story\" button/link within the admin page content that routes to /admin/story/new; adjust spacing/layout for small screens so controls and buttons are full-width and touch-friendly without overflow. (Uses existing shadcn-ui Button/Card components already used on the page; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/AdminStoryNewPage.tsx",
          "operation": "modify",
          "description": "Refine mobile UX for the admin create-story page: ensure form sections stack cleanly, inputs are full-width, and action buttons have adequate spacing/touch targets on small screens while keeping the new thumbnail/YouTube controls usable. (Uses existing shadcn-ui components; Verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}